public class DoubleChecker {

    static String requestAndResposible =
            "Àíîõèíà Åâãåíèÿ (SBT-Anohina-ES):\n" +
                    "CRM-79722 (PM00036576, IM55808744)\n" +
                    "CRM-79527 (PM00036575, IM55205708, CRM-75067)\n" +
                    "CRM-79520 (ÇÍÎ33386645)\n" +
                    "CRM-79433 (ÇÍÎ33232755)\n" +
                    "CRM-79252 (PM00036510, ÇÍÎ31557071)\n" +
                    "CRM-79207 (PM00036580, ÇÍÎ30236960)\n" +
                    "CRM-79176 (PM00036536, IM52624441)\n" +
                    "CRM-79117 (ÇÍÎ32453670)\n" +
                    "CRM-79047 (IM55238281, IM55122218, IM55170722, IM55379408, IM55449472, IM55448551)\n" +
                    "CRM-78841 (IM54635111)\n" +
                    "CRM-78784 (PM00036328, IM53648148)\n" +
                    "CRM-78661 (ÇÍÎ31964516, ÇÍÎ32713657, ÇÍÎ32222106)\n" +
                    "CRM-78648 (PM00036210, IM53135384, IM54734664, IM55181549)\n" +
                    "CRM-78523 (ÇÍÎ31637760)\n" +
                    "CRM-78247 (ÇÍÎ30245124)\n" +
                    "CRM-77272 (IM51840805, IM55253533)\n" +
                    "\n" +
                    "Áàæåíîâ Îëåã (SBT-Bazhenov-OE):\n" +
                    "CRM-79663 (IM55851403)\n" +
                    "CRM-79552 (ÇÍÎ33215192)\n" +
                    "CRM-79531 (IM55631254)\n" +
                    "CRM-79024 (IM55235183)\n" +
                    "CRM-78722 (IM54856908)\n" +
                    "CRM-78703 (IM54802876)\n" +
                    "CRM-78701 (IM54828932)\n" +
                    "CRM-78699 (PM00036213, ÇÍÎ31930454)\n" +
                    "CRM-78665 (IM54752512)\n" +
                    "CRM-78657 (IM54747891)\n" +
                    "CRM-78649 (IM54741231)\n" +
                    "CRM-78605 (IM54660736)\n" +
                    "CRM-78583 (IM54650407)\n" +
                    "CRM-78568 (IM54594154)\n" +
                    "CRM-78232 (IM53764992)\n" +
                    "CRM-78163 (IM53853789, IM53856810)\n" +
                    "\n" +
                    "Áîíäàð÷óê Àíòîí (SBT-Bondarchuk-AS):\n" +
                    "CRM-79754 (PM00036588, IM55234369)\n" +
                    "CRM-79704 (IM55871991)\n" +
                    "CRM-79642 (ÇÍÎ33337482)\n" +
                    "CRM-79586 (IM55629452)\n" +
                    "CRM-79426 (ÇÍÎ33303941)\n" +
                    "CRM-79103 (ÇÍÎ32544542)\n" +
                    "CRM-79088 (IM55269293)\n" +
                    "CRM-79008 (IM55235092)\n" +
                    "CRM-78871 (ÇÍÎ32361971)\n" +
                    "CRM-78832 (PM00036331, IM54818192, IM55023748, IM54998024)\n" +
                    "CRM-78820 (IM55021923)\n" +
                    "CRM-78779 (PM00036332, IM54297840)\n" +
                    "CRM-78629 (ÇÍÎ32106574)\n" +
                    "CRM-78602 (IM54652335, ÇÍÎ32033593)\n" +
                    "CRM-78553 (ÇÍÎ31618344)\n" +
                    "CRM-78468 (IM54165684, ÇÍÎ31966200)\n" +
                    "CRM-78111 (ÇÍÎ30643423)\n" +
                    "CRM-78004 (ÇÍÎ30028521, ÇÍÎ30321438)\n" +
                    "CRM-77896 (PM00035822, IM53209362)\n" +
                    "CRM-77147 (PM00035384 ÇÍÎ26631745, ÇÍÎ26812047)\n" +
                    "\n" +
                    "Äåíèñîâ Ìèõàèë (SBT-Denisov-MA):\n" +
                    "CRM-79525 (PM00036568, IM52463094)\n" +
                    "CRM-79065 (PM00036535, IM54920606)\n" +
                    "CRM-79047 (IM55238281, IM55122218, IM55170722, IM55379408, IM55449472, IM55448551)\n" +
                    "CRM-79011 (IM55235173)\n" +
                    "CRM-78938 (ÇÍÎ31843376)\n" +
                    "CRM-78792 (PM00036254, IM55020317)\n" +
                    "CRM-78684 (ÇÍÎ32217484; IM54777246)\n" +
                    "CRM-78652 (IM54716734, IM54712230)\n" +
                    "CRM-78625 (ÇÍÎ32110823)\n" +
                    "CRM-78500 (ÇÍÎ31476752)\n" +
                    "CRM-78345 (ÇÍÎ31389342)\n" +
                    "CRM-77747 (ÇÍÎ29770344)\n" +
                    "CRM-77720 (ÇÍÎ29676361)\n" +
                    "CRM-77697 (ÇÍÎ29685093)\n" +
                    "CRM-77355 (PM00035583, ÇÍÎ26467855)\n" +
                    "\n" +
                    "Æåðäåâà Èðèíà (SBT-Zherdeva-IN):\n" +
                    "CRM-79722 (PM00036576, IM55808744)\n" +
                    "CRM-79523 (PM00036479, ÇÍÎ30917067)\n" +
                    "CRM-79349 (PM00036578, IM47321940, IM47566053, IM47316133, ÇÍÎ22947720, ÇÍÎ23222095, IM48022538, ÇÍÎ23010304, ÇÍÎ23037726, IM48172974; ÇÍÎ24383719, IM54852917)\n" +
                    "CRM-78715 (IM54794801, IM54674352, ÇÍÎ32425771)\n" +
                    "\n" +
                    "Ìàðêîâ Ñåìåí (SBT-Markov-SA):\n" +
                    "CRM-79722 (PM00036576, IM55808744)\n" +
                    "CRM-78748 (IM54894182)\n" +
                    "CRM-78613 (IM54519861)\n" +
                    "CRM-78246 (ÇÍÎ30917067)\n" +
                    "CRM-77912 (ÇÍÎ29901383)\n" +
                    "CRM-76642 (IM51175114)\n" +
                    "\n" +
                    "Îéêèí Äìèòðèé (Oykin-DV):\n" +
                    "CRM-79709 (IM55701086, IM56281068)\n" +
                    "CRM-79470 (PM00036581, ÇÍÎ33512180)\n" +
                    "CRM-79451 (PM00036566, ÇÍÎ26984306, ÇÍÎ27121565, ÇÍÎ29623516)\n" +
                    "CRM-79424 (IM55544784)\n" +
                    "CRM-79423 (IM55546141)\n" +
                    "CRM-79097 (IM55289012)\n" +
                    "CRM-79048 (PM00036355, IM55235058)\n" +
                    "CRM-78976 (ÇÍÎ32956841)\n" +
                    "CRM-78827 (PM00036326, ÇÍÎ31045386)\n" +
                    "CRM-78770 (ÇÍÎ31896404)\n" +
                    "CRM-78697 (ÇÍÎ30917984, ÇÍÐ03225158)\n" +
                    "CRM-78497 (ÇÍÎ31426396)\n" +
                    "CRM-74581 (IM48540001, IM48521928, ÇÍÎ23778409, ÇÍÎ24024024, IM49287014, IM50407070, IM51077127, IM52985248, IM53315238, IM53356114)\n" +
                    "\n" +
                    "Ïîòàïîâ Íèêèòà (SBT-Potapov-NV):\n" +
                    "CRM-79717 (CRM-79578)\n" +
                    "CRM-79578 (ÇÍÎ33728233, IM55675468)\n" +
                    "CRM-79445 (IM55561325)\n" +
                    "CRM-79431 (PM00036567, ÇÍÎ32269874)\n" +
                    "CRM-79255 (ÇÍÎ33113294)\n" +
                    "CRM-79100 (IM55282215)\n" +
                    "CRM-79023 (PM00036353, IM53982538)\n" +
                    "CRM-78981 (ÇÍÎ32587116)\n" +
                    "CRM-78857 (PM00036329, ÇÍÎ31896404)\n" +
                    "CRM-78827 (PM00036326, ÇÍÎ31045386)\n" +
                    "CRM-78798 (ÇÍÎ32343319)\n" +
                    "CRM-78742 (IM54824817)\n" +
                    "CRM-78702 (ÇÍÎ32218501)\n" +
                    "CRM-78624 (ÇÍÎ31959690)\n" +
                    "CRM-78507 (IM53129348)\n" +
                    "CRM-78435 (ÇÍÎ31162764)\n" +
                    "CRM-78198 (ÇÍÎ30794522, ÇÍÎ30790959)\n" +
                    "CRM-77920 (ÇÍÎ29321101; ÇÍÎ29808324)\n" +
                    "CRM-77610 (PM00035579, ÇÍÎ28438859)\n" +
                    "\n" +
                    "Ñàáèðîâ Ìàðñåëü (SBT-Sabirov-MS):\n" +
                    "CRM-79112 (IM55377044)\n" +
                    "CRM-78853 (ÇÍÎ32633227, ÇÍÎ32159170)\n" +
                    "CRM-78823 (PM00036327, ÇÍÎ32633227, ÇÍÎ32159170)\n" +
                    "CRM-78668 (PM00036228, IM54316932)\n" +
                    "\n" +
                    "Ñåðãóøåíêîâ Àëåêñåé (SBT-Sergushenkov-AYU):\n" +
                    "CRM-79640 (ÇÍÎ33827007)\n" +
                    "CRM-79477 (ÇÍÎ33172757)\n" +
                    "CRM-79436 (ÇÍÎ33379784)\n" +
                    "CRM-79134 (PM00036582, ÇÍÎ32962233)\n" +
                    "CRM-79086 (IM55253651)\n" +
                    "CRM-79079 (IM55302219)\n" +
                    "CRM-78937 (IM55115018)\n" +
                    "CRM-78851 (IM54862184)\n" +
                    "CRM-78815 (IM53752833)\n" +
                    "CRM-78749 (ÇÍÎ30915853)\n" +
                    "CRM-78630 (PM00036229, ÇÍÎ31701511)\n" +
                    "CRM-77903 (IM53097936)\n" +
                    "CRM-77737 (PM00035823, ÇÍÎ26663848)\n" +
                    "CRM-77731 (PM00035792, ÇÍÎ29714982)\n" +
                    "CRM-72000 (PM00033243, IM44668238, IM44662999)\n" +
                    "\n" +
                    "Ñòåðëèêîâ Âèêòîð (SBT-Sterlikov1-VV):\n" +
                    "CRM-79679 (IM55788885, IM55851680, IM55912173, IM55971416)\n" +
                    "CRM-79622 (PM00036577, IM53923944)\n" +
                    "CRM-79299 (IM55512928)\n" +
                    "CRM-78762 (IM54903923, IM54932394, IM54989926, IM54964453, IM54964297, IM54933772, IM55053755, IM55358732, IM55424199, IM55607785, IM56030590)\n" +
                    "CRM-78709 (ÇÍÎ32325625)\n" +
                    "CRM-78655 (ÇÍÎ32159843)\n" +
                    "CRM-78638 (PM00036222, IM54669211, ÇÍÎ32011079,IM54688592)\n" +
                    "CRM-78600 (IM54641765, IM54628699, ÇÍÎ31928220, ÇÍÎ31939464, ÇÍÎ31950149, ÇÍÎ31950758)\n" +
                    "CRM-78555 (IM52711889)\n" +
                    "CRM-77998 (PM00035827, ÇÍÎ25832895;ÇÍÎ20749268,ÇÍÎ21912858;ÇÍÎ22399336, ÇÍÎ22915352; ÇÍÎ23077269; ÇÍÎ23172784, ÇÍÎ24392694, ÇÍÎ24787515, ÇÍÎ24705814, ÇÍÎ24881406, ÇÍÎ25758366, ÇÍÎ25833429; ÇÍÎ25812768, ÇÍÎ25624827; ÇÍÎ26446951, ÇÍÎ27070577; ÇÍÎ27140648, ÇÍÎ28223749)\n" +
                    "CRM-77939 (ÇÍÎ29657523)\n" +
                    "CRM-77598 (ÇÍÎ29179466)\n" +
                    "CRM-77355 (PM00035583, ÇÍÎ26467855)\n" +
                    "CRM-76330 (ÇÍÎ26550708)\n" +
                    "CRM-76237 (ÇÍÎ26468215)\n" +
                    "CRM-76213 (ÇÍÎ26468345)\n" +
                    "CRM-75042 (IM49257560)\n" +
                    "\n" +
                    "Òðàíèí Âàëåðèé (SBT-Tranin-VA):\n" +
                    "CRM-79743 (PM00036587, IM55811782)\n" +
                    "CRM-79251 (PM00036579, ÇÍÎ32864366)\n" +
                    "CRM-79178 (PM00036538, IM55000203, IM55375866)\n" +
                    "CRM-79045 (ÇÍÎ32948217)\n" +
                    "CRM-78916 (IM55102950; IM55140871; IM55191645)\n" +
                    "CRM-78824 (ÇÍÎ32300249, IM55008902)\n" +
                    "CRM-78738 (PM00036221, ÇÍÎ28249920)\n" +
                    "CRM-78688 (PM00036211, IM54668412, ÇÍÎ32304965, ÇÍÎ32411095, IM55062080, IM55125373, ÇÍÎ32750389, IM55177262)\n" +
                    "CRM-78678 (IM54668412)\n" +
                    "CRM-78609 (ÇÍÎ32015828)\n" +
                    "CRM-78467 (IM53533954)\n" +
                    "CRM-77405 (ÇÍÎ29040038,ÇÍÎ29040641,IM52372665,IM52518752,ÇÍÎ29101147,ÇÍÎ29357119,IM52878241,IM52806538,IM52829641,IM52874544,ÇÍÎ29517364,ÇÍÎ29373565,IM52886845,IM53013188,ÇÍÎ29977136,IM53348785,ÇÍÎ30217879,IM53506952,IM53507510,ÇÍÎ30437283,IM53576683,IM53611338)\n" +
                    "CRM-76350 (PM00034932, ÇÍÎ25600046)\n" +
                    "CRM-75672 (ÇÍÎ25600046)\n" +
                    "\n" +
                    "Øåëêîâñêèé Ñòåïàí (SBT-Shelkovskiy-SP):\n" +
                    "CRM-78791 (ÇÍÎ32196053, ÇÍÎ33377155)\n" +
                    "CRM-78662 (IM54756347)\n" +
                    "CRM-78523 (ÇÍÎ31637760)\n" +
                    "CRM-78482 (IM54166661)\n" +
                    "CRM-78078 (ÇÍÎ30547126)\n" +
                    "CRM-78073 (IM53567789)\n" +
                    "CRM-77447 (ÇÍÎ28984321, IM51884772)\n" +
                    "CRM-77082 (ÇÍÎ28337783)\n" +
                    "CRM-73055 (ÇÍÎ21319771)\n" +
                    "\n" +
                    "Øóøàðèí Àíäðåé (SBT-Shusharin-AV):\n" +
                    "CRM-79640 (ÇÍÎ33827007)\n" +
                    "CRM-78673 (ÇÍÎ32133922)\n" +
                    "CRM-78573 (ÇÍÎ31741674)\n" +
                    "CRM-78512 (ÇÍÎ31797461)\n" +
                    "CRM-78459 (ÇÍÎ31569463)\n" +
                    "CRM-78345 (ÇÍÎ31389342)\n" +
                    "CRM-78166 (ÇÍÎ30666860)";

    static String dobles =
                    "CRM-79722 (PM00036576, IM55808744)\n" +
                    "CRM-79047 (IM55238281, IM55122218, IM55170722, IM55379408, IM55449472, IM55448551)\n" +
                    "CRM-78523 (ÇÍÎ31637760)\n" +
                    "CRM-78345 (ÇÍÎ31389342)\n" +
                    "CRM-77355 (PM00035583, ÇÍÎ26467855)\n" +
                    "CRM-78827 (PM00036326, ÇÍÎ31045386)\n" +
                    "CRM-79640 (ÇÍÎ33827007)";

    static String[]stringBuffArr = requestAndResposible.split("\n");
    static String[]arrDoubles = dobles.split("\n");



    public static void main(String[] args) {

//ïîäñ÷èòûâàåò êîëè÷åñòâî çàÿâîê ó êàæäîãî ðàçðàáà
        int countBugs = 0;

        for (int i = stringBuffArr.length-1; i >= 0; i--) {

            if (stringBuffArr[i].contains("CRM-")) {
                countBugs++;
                //continue;
            }
            else if (stringBuffArr[i].length()==0) {
                continue;
            }
            else {
                    stringBuffArr[i] = stringBuffArr[i] + countBugs;
                    countBugs = 0;
                }


            //System.out.println(stringBuffArr[i]);
        }


//for (String i: stringBuffArr) { System.out.println(i); }


for (int i = 0; i < arrDoubles.length; i++) {

      for (int j = 0; j < stringBuffArr.length; j++) {


          if (arrDoubles[i].equals(stringBuffArr[j]) ) {

              System.out.println(j + " " + arrDoubles[i]);


          }


      }

}






    } //end of method

} //end of class
